#+AUTHOR: Ignasi Fosch
#+TITLE: PyBCN Dojo: Gilded Rose Refactoring Kata
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_HLEVEL: 2
#+REVEAL_EXTRA_CSS: dojos.css
#+OPTIONS: toc:2
#+OPTIONS: reveal_progress:t
#+OPTIONS: reveal_title_slide:"<h1>%t</h1><h2>%a</h2>"
#+OPTIONS: reveal_width:1200
#+OPTIONS: reveal_height:800
#+REVEAL_THEME: beige

** The return to the Gilded Rose Inn

Your task now is to add the new feature to our system so that we can begin selling a new category of items.
We have recently signed a supplier of conjured items.
This requires an update to our system:

- “Conjured” items degrade in quality twice as fast as normal items

Same rules on Items class and items property apply here.

#+BEGIN_SRC bash -l :results output :exports none
. ~/.bashrc &>/dev/null && . ~/.bash_profile &>/dev/null && activate gilded-rose &>/dev/null
pytest . && python generate_fixture.py 27 > test_output.txt && diff test_output.txt golden_master.txt
echo -n ""
#+END_SRC

#+RESULTS:
#+begin_example
============================= test session starts ==============================
platform linux -- Python 3.5.4, pytest-3.2.3, py-1.4.34, pluggy-0.4.0
rootdir: /home/ifosch/src/github.com/BCNDojos/pyDojos/gilded-rose, inifile:
collected 1 item

test_gilded_rose.py F

=================================== FAILURES ===================================
___________________________________ test_foo ___________________________________

    def test_foo():
        items = [Item("foo", 0, 0)]
        gilded_rose = GildedRose(items)
        gilded_rose.update_quality()
>       assert "fixme" == items[0].name
E       AssertionError: assert 'fixme' == 'foo'
E         - fixme
E         + foo

test_gilded_rose.py:11: AssertionError
=========================== 1 failed in 0.05 seconds ===========================
#+end_example
